Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The `TimeTable` class has an `@PlanningSolution` annotation, so OptaPlanner knows that this class contains all the input and output data.
ja_jp: `TimeTable` クラスに `@PlanningSolution` アノテーションがあるため、OptaPlanner はこのクラスにすべての入力データと出力データが含まれていると認識します。

source: The `Timeslot` class represents a time interval when lessons are taught, for example, `Monday 10:30 - 11:30` or `Tuesday 13:30 - 14:30`. For simplicity's sake, all time slots have the same duration and there are no time slots during lunch or other breaks.
ja_jp: `Timeslot` クラスは、たとえば `月曜日 10:30 - 11:30` または `火曜日 13:30 - 14:30` のように、レッスンが行われる時間の間隔を表します。簡単にするために、すべてのタイムスロットは同じ時間間隔で、昼食やその他の休憩時間のタイムスロットはありません。

source: The `TlsConfiguration` object contains the keystores, truststores, cipher suites, protocols, and other properties. It also provides a way to create an `SSLContext` from the configuration.
ja_jp: `TlsConfiguration` オブジェクトには、キーストア、トラストストア、暗号スイート、プロトコル、およびその他のプロパティーが含まれています。 また、設定から `SSLContext` を作成する方法も提供します。

source: The `TlsConfiguration` obtained from the `TLSConfigurationRegistry` includes a mechanism for reloading certificates. The `reload` method refreshes the keystores, truststores, and CRLs, typically by reloading them from the file system.
ja_jp: `TLSConfigurationRegistry` から取得された `TlsConfiguration` には、証明書をリロードするためのメカニズムが含まれています。 `reload` メソッドは、通常はファイルシステムからキーストア、トラストストア、CRL をリロードして更新します。

source: The `Tokens` producer will acquire and refresh the tokens, and the custom filter will decide how and when to use the token.
ja_jp: `Tokens` プロデューサーがトークンを取得・更新し、カスタムフィルターが何時、どのようにトークンを使用するかを決定します。

source: The `Tracer` annotation must be removed and instead, we need to inject the OpenTelemetry SDK. We will need it in <3>.
ja_jp: `Tracer`アノテーションを削除し、代わりに OpenTelemetry SDK を注入する必要があります。これは、<3> で必要です。

source: The `Translator_ClientProxy` instance is always injected instead of a direct reference to a https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#contextual_instance[contextual instance, window="_blank"] of the `Translator` bean.
ja_jp: `Translator_ClientProxy` インスタンスは、 `Translator` Beanの https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#contextual_instance[コンテキストインスタンス, window=_blank]への直接参照の代わりに、常に注入されます。

source: The `Translator_ClientProxy` instance is always injected instead of a direct reference to a https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html#contextual_instance[contextual instance, window="_blank"] of the `Translator` bean.
ja_jp: `Translator` Beanの link:https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html#contextual_instance[コンテキストインスタンス] への直接参照ではなく， `Translator_ClientProxy` インスタンスが常に注入される。

source: The `Translator_ClientProxy` instance is always injected instead of a direct reference to a https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#contextual_instance[contextual instance, window="_blank"] of the `Translator` bean.
ja_jp: `Translator_ClientProxy` インスタンスは、 `Translator` Bean の https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#contextual_instance[contextual instance, window="_blank"] への直接参照の代わりに常に挿入されます。

source: The `TypedKey.forBoolean("isCool")` is the key used to obtain the data stored when the connection was created.
ja_jp: `TypedKey.forBoolean("isCool")` は、接続の作成時に保存されたデータを取得するために使用されるキーです。

source: The `Uni` returned from the `KafkaTransactions#withTransaction` will yield a failure if the transaction fails and is aborted. The application can choose to handle the error case, but if a failing `Uni` is returned from the `@Incoming` method, the incoming channel will effectively fail and stop the reactive stream.
ja_jp: `KafkaTransactions#withTransaction` から返された `Uni` は、トランザクションが失敗して中止された場合に失敗します。アプリケーションはエラーケースの処理を選択できますが、失敗した `Uni` が `@Incoming` メソッドから返された場合、着信チャネルは事実上失敗し、リアクティブストリームを停止します。

source: The `Uni` version is very similar:
ja_jp: `Uni` 版は非常に似ています。

source: The `UserInformation` bean in the example can look like this:
ja_jp: 例の `UserInformation` Bean は次のようになります:

source: The `Validator` instance is injected via CDI.
ja_jp: `Validator` インスタンスはCDIで注入されます。

source: The `Value` attribute is the root URL for your lambda. Copy it to your browser and add `hello` at the end.
ja_jp: `Value` 属性は Lambda のルート URL です。これをブラウザにコピーして、最後に `hello` を追加します。

source: The `WasmQuarkusContext` API
ja_jp: `WasmQuarkusContext` API

source: The `WasmQuarkusContext` API provides two key methods:
ja_jp: `WasmQuarkusContext` API は、2 つの主要なメソッドを提供します。

source: The `WebAuthnSecurity` methods do not set or read the user cookie, so you will have to take care of it yourself, but it allows you to use other means of storing the user, such as JWT. You can use the `rememberUser(String userName, RoutingContext ctx)` and `logout(RoutingContext ctx)` methods on the same `WebAuthnSecurity` class if you want to manually set up login cookies.
ja_jp: `WebAuthnSecurity` のメソッドはユーザークッキーを設定したり読み込んだりしないので、自分で対処する必要がありますが、JWT などのユーザーを保存する他の手段を使用することができます。手動でログインクッキーを設定したい場合は、同じ `WebAuthnSecurity` クラスの `rememberUser(String userName, RoutingContext ctx)` と `logout(RoutingContext ctx)` のメソッドを使用することができます。

source: The `WebSocketClientConnection` provides both a blocking and a non-blocking method variants to send messages:
ja_jp: `WebSocketClientConnection` は、メッセージを送信するためのブロッキングメソッドとノンブロッキングメソッドの両方のバリアントを提供します。

source: The `WebSocketConnection` provides both a blocking and a non-blocking method variants to send messages:
ja_jp: `WebSocketConnection` は、メッセージを送信するためのブロッキングメソッドとノンブロッキングメソッドの両方のバリアントを提供します。

source: The `_attributes.adoc` include is required to ensure that attributes get resolved and the table of contents is generated.
ja_jp: 属性が解決され、目次が生成されるようにするには、 `_attributes.adoc` include が必要です。

source: The `_attributes.adoc` include is required to ensure that attributes get resolved, the table of contents is generated, and content renders in the website portal.
ja_jp: `_attributes.adoc` インクルードは、属性が解決され、目次が生成され、コンテンツがウェブサイトポータルにレンダリングされるようにするために必要です。

source: The ``LocaleResolver``s are consulted in the order of `@Priority` (higher priority goes first).
ja_jp: `LocaleResolver` は、 `@Priority` （優先順位の高いものから）順に参照されます。

source: The `add` method inserts an element in the collection. It receives the element as a parameter and uses the reactive API of the collection. Interacting with the database involves I/Os. The reactive principles forbid blocking while waiting for the interaction to complete. Instead, we schedule the operation and pass a continuation. The `insertOne` method returns a Uni, i.e., an asynchronous operation. That's the scheduled I/O. We now need to express the continuation, which is done using the `.onItem()` method. `.onItem()` allows configuring what needs to happen when the observed Uni emits an item, in our case when the scheduled I/Os completes. In this example, we extract the inserted document id. The final step is the subscription. Without it, nothing would ever happen. Subscribing triggers the operation. The subscription method can also define handlers: the `id` value on success, or a failure when the insertion fails.
ja_jp: `add` メソッドは、コレクションに要素を挿入します。このメソッドはパラメータとして要素を受け取り、コレクションのリアクティブAPIを使用します。データベースとのやりとりにはI/Oが伴います。リアクティブな原則では、インタラクションが完了するのを待つ間のブロッキングを禁じています。代わりに、操作をスケジューリングし、継続を渡します。 `insertOne` メソッドはUniを返す、つまり非同期の操作です。これがスケジュールされたI/Oです。 `.onItem()` `.onItem()` では、観測されたUniがアイテムを放出したときに何が起こるべきかを設定することができます。この例では、スケジュールされたI/Oが完了したときです。この例では、挿入されたドキュメントIDを抽出しています。最後のステップはサブスクリプションです。これがなければ何も起こりません。購読することで、操作が開始されます。サブスクリプション・メソッドは、成功時には `id` の値を、挿入が失敗したときには失敗を返すというハンドラーを定義することもできます。

source: The `alg` (algorithm) header is set to `RS256` by default.
ja_jp: `alg` (algorithm) ヘッダーはデフォルトで `RS256` に設定されていることに注意してください。

source: The `alg` (key management algorithm) header defaults to `RSA-OAEP`.
ja_jp: `alg` (キー管理アルゴリズム) ヘッダーのデフォルトは `RSA-OAEP` です。

source: The `aliases` parameter is used to pass the relevant data. We need to make sure that the data are set correctly. In this particular case the fragment will use the expression `user.aliases` as the value of `aliases` in the `{#for alias in aliases}` section.
ja_jp: `aliases` パラメーターは、関連するデータを渡すために使用されます。データが正しく設定されていることを確認する必要があります。この特定のケースでは、フラグメントは `{#for alias in aliases}` セクションの `aliases` の値として式 `user.aliases` を使用します。

source: The `app.quarkus.io/commit-id`, `app.quarkus.io/build-timestamp` labels and the `app.kubernetes.io/version` annotation might change every time we re-build the Kubernetes manifests which can be problematic when we want to deploy these resources using a Git-Ops tool (because these tools will detect differences and hence will perform a re-deployment).
ja_jp: `app.quarkus.io/commit-id` , `app.quarkus.io/build-timestamp` ラベルと `app.kubernetes.io/version` アノテーションは、Kubernetes マニフェストを再ビルドするたびに変わる可能性があり、Git-Ops ツールを使用してこれらのリソースをデプロイしたいときに問題になることがあります（これらのツールは違いを検出し、したがって再デプロイを実行するため）。

source: The `application.yaml` file can also be placed in `config/application.yaml` to specialize the runtime configuration. The file must be present in the root of the working directory relative to the {project-name} application runner:
ja_jp: `application.yaml` ファイルは、実行時設定を特殊化するために `config/application.yaml` に置くこともできます。 このファイルは{project-name}アプリケーション・ランナーに相対する作業ディレクトリのルートに存在しなければなりません：

source: The `application.yaml` file may also be placed in `config/application.yaml` to specialize the runtime configuration. The file has to be present in the root of the working directory relative to the Quarkus application runner:
ja_jp: `application.yaml` ファイルは、実行時設定をカスタマイズするために `config/application.yaml` に配置することもできます。このファイルは、Quarkusアプリケーションランナーに関連する作業ディレクトリのルートに存在しなければなりません。

source: The `application.yaml` file may also be placed in `config/application.yaml` to specialize the runtime configuration. The file has to be present in the root of the working directoryrelative to the Quarkus application runner:
ja_jp: `application.yaml` ファイルは、実行時設定をカスタマイズするために `config/application.yaml` に配置することもできます。このファイルは、Quarkusアプリケーションランナーに関連する作業ディレクトリのルートに存在しなければなりません。

source: The `assign-seek` channel attribute allows manually assigning topic-partitions to a Kafka incoming channel, and optionally seek to a specified offset in the partition to start consuming records. If `assign-seek` is used, the consumer will not be dynamically subscribed to topics, but instead will statically assign the described partitions. In manual topic-partition rebalancing doesn't happen and therefore rebalance listeners are never called.
ja_jp: `assign-seek` チャネル属性を使用すると、topic-partition を Kafka の着信チャネルに手動で割り当て、 オプションで指定したオフセットをシークしてレコードの消費を開始します。 `assign-seek` が使用されると、コンシューマーはトピックに動的にサブスクライブされることはなく、 代わりに記述されたパーティションが静的に割り当てられます。 手動で topic-partition のリバランスは行われないため、リバランスリスナーは呼び出されません。

source: The `b3`, `b3multi`, `jaeger` and `ottrace` propagators will need the https://github.com/open-telemetry/opentelemetry-java/tree/main/extensions/trace-propagators[trace-propagators] extension to be added as a dependency to your project.
ja_jp: `b3`, `b3multi`, `jaeger`, `ottrace` のプロパゲーターは、プロジェクトに link:https://github.com/open-telemetry/opentelemetry-java/tree/main/extensions/trace-propagators[trace-propagators] エクステンションを依存関係として追加する必要があります。

source: The `bar` cache is being configured.
ja_jp: `bar` キャッシュの設定を行っています。

source: The `baseUri` configured in the REST client will be processed by `StorkClientRequestFilter` class, this is a https://quarkus.io/specs/jaxrs/2.1/index.html#filters[JAX-RS filter]. If you need to process the metadata associated with a message: HTTP headers, query parameters, media type, and other metadata, you can implement another filter to configure what you need. Let’s implement a custom filter to add logging capability to our service. We create `CustomLoggingFilter` and annotating it with the @Provider annotation:
ja_jp: REST クライアントで設定された `baseUri` は、 `StorkClientRequestFilter` クラスで処理されます。これは link:https://quarkus.io/specs/jaxrs/2.1/index.html#filters[JAX-RS フィルタ] です。メッセージに関連するメタデータを処理する必要がある場合。HTTPヘッダー、クエリーパラメーター、メディアタイプ、その他のメタデータを処理する必要がある場合は、別のフィルターを実装して必要なものを設定することができます。それでは、サービスにロギング機能を追加するために、カスタムフィルターを実装してみましょう。 `CustomLoggingFilter` を作成し、@Provider アノテーションを付けます。

source: The `baseUri` configured in the REST client will be processed by `StorkClientRequestFilter` class, this is a https://quarkus.io/specs/jaxrs/2.1/index.html#filters[Jakarta REST filter]. If you need to process the metadata associated with a message: HTTP headers, query parameters, media type, and other metadata, you can implement another filter to configure what you need. Let’s implement a custom filter to add logging capability to our service. We create `CustomLoggingFilter` and annotating it with the @Provider annotation:
ja_jp: RESTクライアントで設定された `baseUri` は、 `StorkClientRequestFilter` クラスで処理されます。これは link:https://quarkus.io/specs/jaxrs/2.1/index.html#filters[Jakarta REST フィルタ] です。メッセージに関連するメタデータを処理する必要がある場合：HTTPヘッダー、クエリパラメーター、メディアタイプ、その他のメタデータなど、メッセージに関連するメタデータを処理する必要がある場合は、別のフィルターを実装して必要なものを構成することができます。それでは、サービスにロギング機能を追加するために、カスタムフィルターを実装してみましょう。 `CustomLoggingFilter` を作成し、@Provider アノテーションを付けます：

source: The `birthdate` claim is injected as a `String`. This highlights why the `@RequestScoped` scope is mandatory.
ja_jp: `birthdate` クレームは `String` として挿入されます。これにより、 `@RequestScoped` スコープが必須である理由が強調されます。

source: The `birthdate` claim value
ja_jp: `birthdate` クレーム値

source: The `birthday` claim. It can be considered to be a sensitive claim so you may want to consider encrypting the claims, see xref:smallrye-jwt-build.adoc[Generate JWT tokens with SmallRye JWT].
ja_jp: `birthday` クレームです。機密性の高いクレームと見なすことができるため、クレームの暗号化を検討することをお勧めします。xref:smallrye-jwt-build.adoc[SmallRye JWT を使用した JWT トークンの生成] を参照してください。

source: The `birthday` claim. It can be considered to be a sensitive claim, so you may want to consider encrypting the claims, see xref:security-jwt-build.adoc[Generate JWT tokens with SmallRye JWT].
ja_jp: `birthday` クレームです。機密性の高いクレームと見なすことができるため、クレームの暗号化を検討したくなるかもしれません。 xref:security-jwt-build.adoc[SmallRye JWT を使用した JWT トークンの生成] を参照してください。

source: The `body` template parameter will contain your content
ja_jp: `body` テンプレートパラメーターには、コンテンツが含まれます。

source: The `cache:$cache-name:` segment can be configured using the `prefix` property:
ja_jp: `cache:$cache-name:` セグメントは、 `prefix` プロパティを使用して設定することができます:

source: The `cache`, `client-hints`, `cookies`, `execution-contexts` and wildcard `*` directives can be configured.
ja_jp: `cache`、 `client-hints`、 `cookies`、 `execution-contexts`、およびワイルドカード `*` のディレクティブを設定できます。

source: The `canHandle` method is called to check if the codec can handle a specific type. The parameter received in the `encode` method matches that type. The object returned by the `decode` method must also match that type.
ja_jp: `canHandle` メソッドは、コーデックが特定の型を扱えるかどうかをチェックするために呼び出されます。 `encode` メソッドで受け取るパラメータは、その型と一致します。 `decode` メソッドによって返されるオブジェクトも、その型に一致しなければなりません。

source: The `cert-role-mappings.properties` classpath resource contains a map of certificate's CN values to roles in the form `CN=role` or `CN=role1,role2`, etc. Let us assume it contains three entries: `alice=user,admin`, `bob=user` and `jdoe=tester`.
ja_jp: `cert-role-mappings.properties` クラスパスリソースには、 `CN=role` または `CN=role1,role2` などの形式で、ロールへの証明書の CN 値のマップが含まれています。ここで、 `alice=user,admin`、 `bob=user`、および `jdoe=tester` の 3 つのエントリーが含まれていると仮定します。

source: The `cert-role-mappings.properties` classpath resource contains a map of certificate's CN values to roles in the form `CN=role` or `CN=role1,role2`, etc. Let's assume it contains three entries: `alice=user,admin`, `bob=user` and `jdoe=tester`.
ja_jp: `cert-role-mappings.properties` クラスパスリソースには、 `CN=role` または `CN=role1,role2` などの形式で、ロールへの証明書の CN 値のマップが含まれています。ここで、 `alice=user,admin`、 `bob=user`、および `jdoe=tester` の 3 つのエントリーが含まれていると仮定します。

source: The `channel-name` segment must match the value set in the `@Incoming` and `@Outgoing` annotation:
ja_jp: `channel-name` セグメントは、 `@Incoming` および `@Outgoing` アノテーションで設定された値と一致する必要があります。

source: The `checkpoint` commit strategy is an experimental feature and can change in the future.
ja_jp: `checkpoint` コミットストラテジーは実験的な API であり、将来変更される可能性があります。

source: The `client-name` is the name set in the `@GrpcClient` or derived from the injection point if not explicitly defined.
ja_jp: `client-name` は、 `@GrpcClient` で設定された名称、または明示的に定義されていない場合は、インジェクションポイントから派生した名称です。

source: The `client_credentials` grant allows setting extra parameters for the token request by using `quarkus.oidc-client.grant-options.client.<param-name>=<value>`.
ja_jp: `client_credentials` グラントでは、 `quarkus.oidc-client.grant-options.client.<param-name>=<value>` を使用して、トークンリクエストに追加のパラメーターを設定できます。

source: The `client_credentials` grant allows setting extra parameters for the token request by using `quarkus.oidc-client.grant-options.client.<param-name>=<value>`. Here is how to set the intended token recipient by using the `audience` parameter:
ja_jp: `client_credentials` グラントでは、 `quarkus.oidc-client.grant-options.client.<param-name>=<value>` を使用してトークンリクエストの追加パラメーターを設定できます。ここでは、 `audience` パラメーターを使用して、トークンの受信者を設定する方法を説明します。

source: The `client_credentials` grant allows to set extra parameters to the token request via `quarkus.oidc-client.grant-options.client.<param-name>=<value>`. Here is how to set the intended token recipient via the `audience` parameter:
ja_jp: `client_credentials` グラントにより、 `quarkus.oidc-client.grant-options.client.<param-name>=<value>` を介してトークンリクエストに追加のパラメータを設定できます。 `audience` パラメータを使用して目的のトークン受信者を設定する方法は次のとおりです。

source: The `color-service` is the Kubernetes service which is the entry point to the Blue and Red instances.
ja_jp: `color-service` は、Blue と Red のインスタンスへのエントリーポイントとなる Kubernetes サービスです。

source: The `config/application.properties` is also available in `dev` mode. The file needs to be placed inside the build tool output directory (`target` for Maven and `build/classes/java/main` for Gradle). Keep in mind however that any cleaning operation from the build tool like `mvn clean` or `gradle clean` will remove the `config` directory as well.
ja_jp: `config/application.properties` は `dev` モードでも利用可能です。ファイルは、ビルドツールの出力ディレクトリー (Maven の場合は `target` 、Gradle の場合は `build/classes/java/main`) の中に置く必要があります。ただし、 `mvn clean` や `gradle clean` のようなビルドツールからのクリーンアップ操作は、 `config` ディレクトリーも削除してしまうことに注意してください。

source: The `configChain` function has its Cloud Event mapping changed by configuration within link:{quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/main/resources/application.properties[application.properties].
ja_jp: `configChain` 関数のクラウド イベント マッピングは、 link:{quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/main/resources/application.properties[application.properties] 内の設定プロパティによって変更されます。

source: The `configChain` function has its Cloud Event mapping changed by configuration within {quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/main/resources/application.properties[application.properties].
ja_jp: `configChain` 関数は、 {quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/main/resources/application.properties[application.properties] 内の設定により、 Cloud Event のマッピングが変更されています。

source: The `configuration-resource` is build time property and the file will be included in the native build automatically. `configuration-uri` can also point to a file under the `resources` folder. However, the file won't be automatically included in the native executable, unless you configure the property `quarkus.native.resources.includes`.
ja_jp: `configuration-resource` はビルド時のプロパティで、ファイルは自動的にネイティブビルドに含まれます。 `configuration-uri` は、 `resources` フォルダ下のファイルを指すこともできます。ただし、 `quarkus.native.resources.includes` プロパティを設定しない限り、ファイルはネイティブ実行可能ファイルに自動的に含まれません。

source: The `connector` attribute is required for all channels and specifies the connector to use. You can omit this configuration if you have a single connector on your classpath, as Quarkus will automatically select the connector.
ja_jp: `connector` 属性はすべてのチャネルに必須であり、使用するコネクターを指定します。 クラスパスにコネクターが 1 つしかない場合は、Quarkus が自動的にコネクターを選択するため、この設定を省略できます。

source: The `create-extension` Maven Mojo can create the test and integration-test structure (drop the `-DwithoutTests`). Here, we'll create it ourselves:
ja_jp: 現在、 `create-extension` Maven Mojo はテストと統合テスト構造 (`-DwithoutTests` をドロップ) を作成できます。ここでは、自分たちで作成します。

source: The `createParentContext()` method explains how to create an OpenTelemetry context. In this case we generate the default https://www.w3.org/TR/trace-context/[W3C Trace Context] header: `traceparent`.
ja_jp: `createParentContext()` メソッドは、OpenTelemetry コンテキストを作成する方法を説明しています。この場合、デフォルトの https://www.w3.org/TR/trace-context/[W3C Trace Context] ヘッダーである `traceparent` を生成します。

source: The `create` method allows adding a new fruit to the database:
ja_jp: `create` メソッドでは、新しいフルーツをデータベースに追加することができます。

source: The `credential_configuration_id` field value `vc-scope-mapping` is added to the `authorization_details` as a string.
ja_jp: `credential_configuration_id` フィールドの値 `vc-scope-mapping` は、文字列として `authorization_details` に追加されます。

source: The `credentials-mount` is used directly as the mount of the secret engine in Vault. Here we are using the default mount path of `rabbitmq`. If the RabbitMQ secret engine was mounted at a custom path, the `credentials-mount` option must be set to that path instead.
ja_jp: `credentials-mount` は、Vault のシークレットエンジンのマウントとして直接使用されます。ここでは、デフォルトのマウントパスである `rabbitmq` を使用しています。RabbitMQ シークレットエンジンがカスタムパスにマウントされている場合は、代わりに `credentials-mount` オプションをそのパスに設定する必要があります。

source: The `cron` attribute supports <<config-reference#property-expressions,Property Expressions>> including default values and nested Property Expressions. (Note that "{property.path}" style expressions are still supported but don't offer the full functionality of Property Expressions.)
ja_jp: `cron` 属性は、デフォルト値とネストされた値プロパティー式を含む<<config-reference#property-expressions,Property Expressions>> をサポートします。 ("{property.path}" スタイルの式は引き続きサポートされますが、プロパティー式の機能がすべて提供されるわけではありません。)

source: The `cron` attribute supports xref:config-reference.adoc#property-expressions[Property Expressions] including default values and nested Property Expressions. (Note that "{property.path}" style expressions are still supported but don't offer the full functionality of Property Expressions.)
ja_jp: `cron` 属性は、デフォルト値やネストされたProperty Expressionを含む xref:config-reference.adoc#property-expressions[Property Expression] に対応しています。(なお、"{property.path}"スタイル式はまだサポートされていますが、Property Expressionsの全機能を提供するものではありません。)

source: The `customAuthorizationHeader` field is not public, therefore Quarkus access this field with the `customAuthorizationHeader` accessor. That is particularly useful with Java records, where generated accessors are not prefixed with `get`.
ja_jp: `customAuthorizationHeader` フィールドはパブリックではないため、Quarkus は `customAuthorizationHeader` アクセサーを使用してこのフィールドにアクセスします。 これは、生成されたアクセサーに接頭辞 `get` が付かない Java レコードで特に便利です。

source: The `custom` name must match the name specified with the `io.quarkus.vertx.http.security.AuthorizationPolicy#name` attribute.
ja_jp: `custom` という名前は、`io.quarkus.vertx.http.security.AuthorizationPolicy#name` 属性で指定された名前と一致する必要があります。

source: The `data` (and public `metadata`) of the codestart to generate (specified in the `codestart.yml`)
ja_jp: 生成するCodestartの `data` （および公開 `metadata` ）（ `codestart.yml` で指定されている）

source: The `data` attribute contains the wrapped business event. It is an essential part, and the other attributes are just providing details about that specific business event.
ja_jp: `data` 属性には、ラップされたビジネスイベントが含まれています。これは本質的な部分であり、他の属性はその特定のビジネスイベントについての詳細を提供しているだけです。
